run/tutorials/multiphase/compressibleInterFoam/laminar/cylinder/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regionName      wallFilmRegion;

phase           liquid;

viscosity
{
    model        Newtonian;
}

sigma       0.07;

deltaWet    1e-4;

hydrophilic no;

transfer
{
    VoFPatchTransfer
    {
        deltaFactorToVoF  0.2;
        alphaToVoF        0.2;

        deltaFactorToFilm 0;
        alphaToFilm       0;

        transferRateCoeff 0.1;
    }
}

momentumTransport
{
    model       laminar;
    Cf          0.005;
}

forces
{
    thermocapillary;
}

upperSurfaceModels
{
    heatTransfer
    {
        model    constant;
        c0       1e-8;
    }
}

lowerSurfaceModels
{
    heatTransfer
    {
        model   constant;
        c0      1e-8;
    }
}


// ************************************************************************* //
